neovim/configs/02-keybindings.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Neovim Keybindings Configuration</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/style.css"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="content">
<h1 class="title">Neovim Keybindings Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0632fb5">1. Normal Mode Mappings</a>
<ul>
<li><a href="#orgee4bbfc">1.1. Basic Keymaps</a></li>
<li><a href="#orge9f3878">1.2. Navigation with Centering</a></li>
<li><a href="#org95c1d0c">1.3. Buffer Navigation</a></li>
<li><a href="#orgf696f27">1.4. Window Management</a></li>
<li><a href="#orge28b3d3">1.5. Line Movement</a></li>
<li><a href="#orgab710e1">1.6. File Operations</a></li>
<li><a href="#orga616970">1.7. Miscellaneous</a></li>
</ul>
</li>
<li><a href="#orgf067d29">2. Visual Mode Mappings</a>
<ul>
<li><a href="#org5ad7caf">2.1. Paste and Delete</a></li>
<li><a href="#org69d11f4">2.2. Line Movement in Visual Mode</a></li>
<li><a href="#orgc4897e6">2.3. Indentation</a></li>
<li><a href="#org3af3592">2.4. Escape in Visual Mode</a></li>
</ul>
</li>
<li><a href="#org82a4d43">3. Insert Mode Mappings</a>
<ul>
<li><a href="#org48db6c1">3.1. Quick Escape</a></li>
<li><a href="#orgc70f785">3.2. Emacs-style Navigation</a></li>
<li><a href="#orgf796a0c">3.3. Word Navigation</a></li>
<li><a href="#org54ea9b7">3.4. Word Deletion</a></li>
</ul>
</li>
<li><a href="#org48a56c5">4. Command Mode Mappings</a>
<ul>
<li><a href="#orge554619">4.1. Navigation</a></li>
<li><a href="#org2cf960d">4.2. Word Movement</a></li>
<li><a href="#orgd7da533">4.3. Deletion</a></li>
</ul>
</li>
<li><a href="#orgee086e3">5. Useful Functions</a>
<ul>
<li><a href="#org21417e4">5.1. Copy Full File Path</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0632fb5" class="outline-2">
<h2 id="org0632fb5"><span class="section-number-2">1.</span> Normal Mode Mappings</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgee4bbfc" class="outline-3">
<h3 id="orgee4bbfc"><span class="section-number-3">1.1.</span> Basic Keymaps</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-lua">-- Normal mode mappings
vim.keymap.set("n", "&lt;leader&gt;c", ":nohlsearch&lt;CR&gt;", { desc = "Clear search highlights" })

-- Y to EOL
vim.keymap.set("n", "Y", "y$", { desc = "Yank to end of line" })
</pre>
</div>
</div>
</div>

<div id="outline-container-orge9f3878" class="outline-3">
<h3 id="orge9f3878"><span class="section-number-3">1.2.</span> Navigation with Centering</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-lua">-- Center screen when jumping
vim.keymap.set("n", "n", "nzzzv", { desc = "Next search result (centered)" })
vim.keymap.set("n", "N", "Nzzzv", { desc = "Previous search result (centered)" })
vim.keymap.set("n", "&lt;C-d&gt;", "&lt;C-d&gt;zz", { desc = "Half page down (centered)" })
vim.keymap.set("n", "&lt;C-u&gt;", "&lt;C-u&gt;zz", { desc = "Half page up (centered)" })
</pre>
</div>
</div>
</div>

<div id="outline-container-org95c1d0c" class="outline-3">
<h3 id="org95c1d0c"><span class="section-number-3">1.3.</span> Buffer Navigation</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-lua">-- Buffer navigation
vim.keymap.set("n", "&lt;leader&gt;]", ":bnext&lt;CR&gt;", { desc = "Next buffer" })
vim.keymap.set("n", "&lt;leader&gt;[", ":bprevious&lt;CR&gt;", { desc = "Previous buffer" })
vim.keymap.set("n", "&lt;leader&gt;k", ":bd%&lt;CR&gt;", { desc = "Kill current buffer" })
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf696f27" class="outline-3">
<h3 id="orgf696f27"><span class="section-number-3">1.4.</span> Window Management</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-lua">-- Splitting &amp; Resizing
vim.keymap.set("n", "&lt;leader&gt;|", ":vsplit&lt;CR&gt;", { desc = "Split window vertically" })
vim.keymap.set("n", "&lt;leader&gt;_", ":split&lt;CR&gt;", { desc = "Split window horizontally" })
vim.keymap.set("n", "&lt;C-Up&gt;", ":resize +2&lt;CR&gt;", { desc = "Increase window height" })
vim.keymap.set("n", "&lt;C-Down&gt;", ":resize -2&lt;CR&gt;", { desc = "Decrease window height" })
vim.keymap.set("n", "&lt;C-Left&gt;", ":vertical resize -2&lt;CR&gt;", { desc = "Decrease window width" })
vim.keymap.set("n", "&lt;C-Right&gt;", ":vertical resize +2&lt;CR&gt;", { desc = "Increase window width" })
</pre>
</div>
</div>
</div>

<div id="outline-container-orge28b3d3" class="outline-3">
<h3 id="orge28b3d3"><span class="section-number-3">1.5.</span> Line Movement</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-lua">-- Move lines up/down
vim.keymap.set("n", "&lt;A-j&gt;", ":m .+1&lt;CR&gt;==", { desc = "Move line down" })
vim.keymap.set("n", "&lt;A-k&gt;", ":m .-2&lt;CR&gt;==", { desc = "Move line up" })
</pre>
</div>
</div>
</div>

<div id="outline-container-orgab710e1" class="outline-3">
<h3 id="orgab710e1"><span class="section-number-3">1.6.</span> File Operations</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">
<pre class="src src-lua">-- Quick file navigation
-- vim.keymap.set("n", "&lt;leader&gt;e", ":Neotree toggle&lt;CR&gt;", { desc = "Open file explorer" })
vim.keymap.set("n", "&lt;leader&gt;ff", ":find ", { desc = "Find file" })

-- Quick config editing
vim.keymap.set("n", "&lt;leader&gt;rc", ":e ~/.config/nvim/init.lua&lt;CR&gt;", { desc = "Edit config" })
</pre>
</div>
</div>
</div>

<div id="outline-container-orga616970" class="outline-3">
<h3 id="orga616970"><span class="section-number-3">1.7.</span> Miscellaneous</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">
<pre class="src src-lua">-- Better J behavior
vim.keymap.set("n", "J", "mzJ`z", { desc = "Join lines and keep cursor position" })

-- Escape mapping
local opts = { noremap = true, silent = true }
vim.keymap.set("n", "&lt;C-g&gt;", "&lt;ESC&gt;", opts)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf067d29" class="outline-2">
<h2 id="orgf067d29"><span class="section-number-2">2.</span> Visual Mode Mappings</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org5ad7caf" class="outline-3">
<h3 id="org5ad7caf"><span class="section-number-3">2.1.</span> Paste and Delete</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-lua">-- Better paste behavior
vim.keymap.set("x", "&lt;leader&gt;p", '"_dP', { desc = "Paste without yanking" })

-- Delete without yanking
vim.keymap.set({ "n", "v" }, "&lt;leader&gt;d", '"_d', { desc = "Delete without yanking" })
</pre>
</div>
</div>
</div>

<div id="outline-container-org69d11f4" class="outline-3">
<h3 id="org69d11f4"><span class="section-number-3">2.2.</span> Line Movement in Visual Mode</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-lua">vim.keymap.set("v", "&lt;A-j&gt;", ":m '&gt;+1&lt;CR&gt;gv=gv", { desc = "Move selection down" })
vim.keymap.set("v", "&lt;A-k&gt;", ":m '&lt;-2&lt;CR&gt;gv=gv", { desc = "Move selection up" })
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc4897e6" class="outline-3">
<h3 id="orgc4897e6"><span class="section-number-3">2.3.</span> Indentation</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-lua">-- Better indenting in visual mode
vim.keymap.set("v", "&lt;", "&lt;gv", { desc = "Indent left and reselect" })
vim.keymap.set("v", "&gt;", "&gt;gv", { desc = "Indent right and reselect" })
</pre>
</div>
</div>
</div>

<div id="outline-container-org3af3592" class="outline-3">
<h3 id="org3af3592"><span class="section-number-3">2.4.</span> Escape in Visual Mode</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-lua">vim.keymap.set("v", "&lt;C-g&gt;", "&lt;ESC&gt;", opts)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org82a4d43" class="outline-2">
<h2 id="org82a4d43"><span class="section-number-2">3.</span> Insert Mode Mappings</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org48db6c1" class="outline-3">
<h3 id="org48db6c1"><span class="section-number-3">3.1.</span> Quick Escape</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-lua">-- Motions in insert mode
vim.keymap.set("i", "jj", "&lt;ESC&gt;", opts)
vim.keymap.set("i", "&lt;C-g&gt;", "&lt;ESC&gt;", opts)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc70f785" class="outline-3">
<h3 id="orgc70f785"><span class="section-number-3">3.2.</span> Emacs-style Navigation</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-lua">vim.keymap.set("i", "&lt;C-f&gt;", "&lt;Right&gt;", opts)
vim.keymap.set("i", "&lt;C-b&gt;", "&lt;Left&gt;", opts)
vim.keymap.set("i", "&lt;C-n&gt;", "&lt;Down&gt;", opts)
vim.keymap.set("i", "&lt;C-p&gt;", "&lt;Up&gt;", opts)
vim.keymap.set("i", "&lt;C-a&gt;", "&lt;Home&gt;", opts)
vim.keymap.set("i", "&lt;M-m&gt;", "&lt;C-o&gt;_", opts)
vim.keymap.set("i", "&lt;C-e&gt;", "&lt;End&gt;", opts)
vim.keymap.set("i", "&lt;C-d&gt;", "&lt;Del&gt;", opts)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf796a0c" class="outline-3">
<h3 id="orgf796a0c"><span class="section-number-3">3.3.</span> Word Navigation</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-lua">vim.keymap.set("i", "&lt;M-Right&gt;", "&lt;C-o&gt;w", opts)
vim.keymap.set("i", "&lt;M-f&gt;", "&lt;C-o&gt;w", opts)
vim.keymap.set("i", "&lt;M-Left&gt;", "&lt;C-o&gt;b", opts)
vim.keymap.set("i", "&lt;M-b&gt;", "&lt;C-o&gt;b", opts)
</pre>
</div>
</div>
</div>

<div id="outline-container-org54ea9b7" class="outline-3">
<h3 id="org54ea9b7"><span class="section-number-3">3.4.</span> Word Deletion</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre class="src src-lua">vim.keymap.set("i", "&lt;M-BS&gt;", "&lt;C-o&gt;db", opts)
vim.keymap.set("i", "&lt;M-DEL&gt;", "&lt;C-o&gt;dw", opts)
vim.keymap.set("i", "&lt;M-d&gt;", "&lt;C-o&gt;dw", opts)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org48a56c5" class="outline-2">
<h2 id="org48a56c5"><span class="section-number-2">4.</span> Command Mode Mappings</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orge554619" class="outline-3">
<h3 id="orge554619"><span class="section-number-3">4.1.</span> Navigation</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-lua">-- Motions in minibuffer
vim.keymap.set("c", "&lt;C-f&gt;", "&lt;Right&gt;")
vim.keymap.set("c", "&lt;C-b&gt;", "&lt;Left&gt;")
vim.keymap.set("c", "&lt;C-p&gt;", "&lt;Up&gt;")
vim.keymap.set("c", "&lt;M-p&gt;", "&lt;Up&gt;")
vim.keymap.set("c", "&lt;C-n&gt;", "&lt;Down&gt;")
vim.keymap.set("c", "&lt;M-n&gt;", "&lt;Down&gt;")
</pre>
</div>
</div>
</div>

<div id="outline-container-org2cf960d" class="outline-3">
<h3 id="org2cf960d"><span class="section-number-3">4.2.</span> Word Movement</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-lua">vim.keymap.set("c", "&lt;M-f&gt;", "&lt;C-Right&gt;")
vim.keymap.set("c", "&lt;M-b&gt;", "&lt;C-Left&gt;")
vim.keymap.set("c", "&lt;C-a&gt;", "&lt;Home&gt;")
vim.keymap.set("c", "&lt;C-e&gt;", "&lt;End&gt;")
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd7da533" class="outline-3">
<h3 id="orgd7da533"><span class="section-number-3">4.3.</span> Deletion</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-lua">vim.keymap.set("c", "&lt;C-d&gt;", "&lt;Del&gt;")
vim.keymap.set("c", "&lt;M-d&gt;", "&lt;C-Del&gt;")
vim.keymap.set("c", "&lt;M-BS&gt;", "&lt;C-BS&gt;")
vim.keymap.set("c", "&lt;C-g&gt;", "&lt;ESC&gt;")
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgee086e3" class="outline-2">
<h2 id="orgee086e3"><span class="section-number-2">5.</span> Useful Functions</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org21417e4" class="outline-3">
<h3 id="org21417e4"><span class="section-number-3">5.1.</span> Copy Full File Path</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-lua">-- ============================================================================
-- USEFUL FUNCTIONS
-- ============================================================================

-- Copy Full File-Path
vim.keymap.set("n", "&lt;leader&gt;pa", function()
  local path = vim.fn.expand("%:p")
  vim.fn.setreg("+", path)
  print("file:", path)
end)
</pre>
</div>
</div>
</div>
</div>
</main>
<footer id="postamble" class="status">
<p class="date">Date: 2025-12-01</p>
</footer>
</body>
</html>
